aaron-bond.better-comments
alefragnani.project-manager
anysphere.cursorpyright
bierner.markdown-mermaid
boto3typed.boto3-ide
charliermarsh.ruff
datadog.datadog-vscode
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.vscode-github-actions
golang.go
hashicorp.hcl
hashicorp.terraform
jebbs.plantuml
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
redhat.vscode-yaml
rust-lang.rust-analyzer
scala-lang.scala
shopify.ruby-lsp
tamasfe.even-better-toml
vscodevim.vim
ziglang.vscode-zig
